In [2]:
!pip install --upgrade pip

Requirement already satisfied: pip in ./venv/lib/python3.9/site-packages (21.2.4)
Collecting pip
  Downloading pip-24.0-py3-none-any.whl (2.1 MB)
     |████████████████████████████████| 2.1 MB 16.1 MB/s eta 0:00:01
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 21.2.4
    Uninstalling pip-21.2.4:
      Successfully uninstalled pip-21.2.4
Successfully installed pip-24.0

In [3]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.1-cp39-cp39-macosx_11_0_arm64.whl.metadata (19 kB)
Collecting numpy<2,>=1.22.4 (from pandas)
  Downloading numpy-1.26.4-cp39-cp39-macosx_11_0_arm64.whl.metadata (61 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 61.1/61.1 kB 4.8 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in ./venv/lib/python3.9/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.1-cp39-cp39-macosx_11_0_arm64.whl (11.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.3/11.3 MB 69.0 MB/s eta 0:00:00a 0:00:01
Downloading numpy-1.26.4-cp39-cp39-macosx_11_0_arm64.whl (14.0 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 14.0/14.0 MB 69.3 MB/s eta 0:00:0000:0100:01
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 505.5/505.5 kB 49.1 MB/s eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 345.4/345.4 kB 50.2 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-1.26.4 pandas-2.2.1 pytz-2024.1 tzdata-2024.1

In [4]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 kB 14.3 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

In [11]:
import pandas as pd

In [12]:
df = pd.read_excel('/Users/calvinpineda/Downloads/voyage-tropics.xlsx')

In [6]:
df.head()

,Voyage ID,Voyage Description,Shore Excursion Amount
0,RVA251008,Set sail beyond the ordinary with our 2025-202...,800
1,RVA251022,Set sail beyond the ordinary with our 2025-202...,800
2,RVA251106,Set sail beyond the ordinary with our 2025-202...,600
3,SIR251107,Set sail beyond the ordinary with our 2025-202...,1200
4,NAU260227,Set sail beyond the ordinary with our 2025-202...,1200

In [4]:
df

,Voyage ID,Voyage Description,Shore Excursion Amount
0,RVA251008,Set sail beyond the ordinary with our 2025-202...,800
1,RVA251022,Set sail beyond the ordinary with our 2025-202...,800
2,RVA251106,Set sail beyond the ordinary with our 2025-202...,600
3,SIR251107,Set sail beyond the ordinary with our 2025-202...,1200
4,NAU260227,Set sail beyond the ordinary with our 2025-202...,1200
...,...,...,...
130,ALU260104A,Set sail beyond the ordinary with our 2025-202...,1200
131,ALU260309A,Set sail beyond the ordinary with our 2025-202...,1400
132,ALU260404B,Set sail beyond the ordinary with our 2025-202...,1800
133,MNA260407A,Set sail beyond the ordinary with our 2025-202...,1200
134,ALU260414A,Set sail beyond the ordinary with our 2025-202...,1200

In [5]:
df.tail()

,Voyage ID,Voyage Description,Shore Excursion Amount
130,ALU260104A,Set sail beyond the ordinary with our 2025-202...,1200
131,ALU260309A,Set sail beyond the ordinary with our 2025-202...,1400
132,ALU260404B,Set sail beyond the ordinary with our 2025-202...,1800
133,MNA260407A,Set sail beyond the ordinary with our 2025-202...,1200
134,ALU260414A,Set sail beyond the ordinary with our 2025-202...,1200

In [22]:
def add_comma(amount): # only return amount
    if len(str(amount)) == 4:
        return "{:,}".format(amount) # :, automatically adds comma seperator to thousand place numbers - returns string
    else:
        return str(amount)

In [17]:
def replace_values(description,amount):
    format_amount = add_comma(amount) # the amount returned will always be a string
    return description.replace('XXX',format_amount)

In [18]:
df['Voyage Description'] = df.apply(lambda row: replace_values(row['Voyage Description'], row['Shore Excursion Amount']), axis=1)

In [8]:
df['Voyage Description'].head()

0    Set sail beyond the ordinary with our 2025-202...
1    Set sail beyond the ordinary with our 2025-202...
2    Set sail beyond the ordinary with our 2025-202...
3    Set sail beyond the ordinary with our 2025-202...
4    Set sail beyond the ordinary with our 2025-202...
Name: Voyage Description, dtype: object

In [9]:
# i need to expand the trunkated view to see if the amount was updated

In [19]:
for x in df['Voyage Description'].head():
    print(x)
    print('---')

Set sail beyond the ordinary with our 2025-2026 Tropics & Exotics Collection and enjoy 2 for 1 Cruise Fares, Free Roundtrip Airfare with Free Airport Transfers* and valuable <i>simply</i> MORE* amenities:
<br><br>
FREE $800 <i>simply</i> MORE Shore Excursion Credit<br>
FREE Champagne, Wine & More<br>
FREE Gourmet Specialty Dining<br>
FREE Unlimited WiFi<br>
<i>Amenities are per stateroom</i>
---
Set sail beyond the ordinary with our 2025-2026 Tropics & Exotics Collection and enjoy 2 for 1 Cruise Fares, Free Roundtrip Airfare with Free Airport Transfers* and valuable <i>simply</i> MORE* amenities:
<br><br>
FREE $800 <i>simply</i> MORE Shore Excursion Credit<br>
FREE Champagne, Wine & More<br>
FREE Gourmet Specialty Dining<br>
FREE Unlimited WiFi<br>
<i>Amenities are per stateroom</i>
---
Set sail beyond the ordinary with our 2025-2026 Tropics & Exotics Collection and enjoy 2 for 1 Cruise Fares, Free Roundtrip Airfare with Free Airport Transfers* and valuable <i>simply</i> MORE* amenities:
<br><br>
FREE $600 <i>simply</i> MORE Shore Excursion Credit<br>
FREE Champagne, Wine & More<br>
FREE Gourmet Specialty Dining<br>
FREE Unlimited WiFi<br>
<i>Amenities are per stateroom</i>
---
Set sail beyond the ordinary with our 2025-2026 Tropics & Exotics Collection and enjoy 2 for 1 Cruise Fares, Free Roundtrip Airfare with Free Airport Transfers* and valuable <i>simply</i> MORE* amenities:
<br><br>
FREE $1,200 <i>simply</i> MORE Shore Excursion Credit<br>
FREE Champagne, Wine & More<br>
FREE Gourmet Specialty Dining<br>
FREE Unlimited WiFi<br>
<i>Amenities are per stateroom</i>
---
Set sail beyond the ordinary with our 2025-2026 Tropics & Exotics Collection and enjoy 2 for 1 Cruise Fares, Free Roundtrip Airfare with Free Airport Transfers* and valuable <i>simply</i> MORE* amenities:
<br><br>
FREE $1,200 <i>simply</i> MORE Shore Excursion Credit<br>
FREE Champagne, Wine & More<br>
FREE Gourmet Specialty Dining<br>
FREE Unlimited WiFi<br>
<i>Amenities are per stateroom</i>
---

In [20]:
df.to_excel('/Users/calvinpineda/Downloads/modified-voyages-with-commas-tropics.xlsx', index=False)